{
  "reviews": [
    {
      "reviewer": "Jonathan",
      "time_posted": "4 months ago",
      "review_text": "Robert (Marchewka) was so helpful and informative during our recent session re: my retirement plans. He was extremely knowledgable, and insightful, and he took the time to answer all of my questions, present me with different options, and he showed me numbers based on those options. He was also very nice and easy to talk to - I felt like he understood all of my concerns, and he really had my best interests in mind. I highly recommend speaking with Robert if you have any questions or concerns about your retirement or life insurance options.",
      "state": "New Hampshire",
      "school_district": "Nashua School District",
      "job_title": "High School Mathematics Teacher"
    },
    {
      "reviewer": "Alex Gautieri",
      "time_posted": "5 months ago",
      "review_text": "Cal from Rise North Capital has been incredibly helpful for me over the last year or so. When he and I first met I had 2 different 401k’s or 403b’s with 3 different jobs and I was just starting out at a new job about to open a 4th account with my new company. I had no idea how to roll any of them over into each other, but Cal not only helped explain the process to me, he called each company with me on the line to walk through the process together to make it as painless as possible. Now all of my money sits in 1 account to collect as much interest as possible, and he and I have moved on to other financial goals together. I can honestly say I never would have done that without his help. I’m so grateful to Rise North Capital to their services, and Cal specifically for how knowledgeable, responsive, and kind he has been every step of the way. Highly recommend this company!",
      "state": "Connecticut",
      "school_district": "Stamford Public Schools",
      "job_title": "Instructional Technology Specialist"
    },
    {
      "reviewer": "Marie Amutan",
      "time_posted": "5 months ago",
      "review_text": "The financial professional I worked with was incredibly kind, patient, and knowledgeable. He took the time to explain everything in a way that was easy to understand, making the process smooth and stress-free. I truly appreciate their professionalism and dedication to helping clients make informed financial decisions. Highly recommend!",
      "state": "Rhode Island",
      "school_district": "Providence Public School District",
      "job_title": "School Nurse"
    },
    {
      "reviewer": "Regine Michel",
      "time_posted": "0 year ago",
      "review_text": "I cannot thank Derek Sage enough for his exceptional guidance and patience in securing the perfect retirement policy tailored to my needs. Both he and Rhys made me feel comfortable and treated me with genuine respect, speaking to me on a personal level. The entire process was transparent, and all my questions were answered thoroughly. I wholeheartedly recommend Derek and Rise North Capital to my close friends and family. Remember to do your own research and feel free to ask questions—Derek ensures that any requested documents are provided promptly. Thank you, Derek, and the team at Rise North Capital!",
      "state": "Massachusetts",
      "school_district": "Boston Public Schools",
      "job_title": "District Human Resources Specialist"
    },
    {
      "reviewer": "Andrew Jeffery",
      "time_posted": "0 year ago",
      "review_text": "Brandon Ortiz was very helpful and courteous. I appreciate the time he took making sure how he could be helpful.",
      "state": "Vermont",
      "school_district": "Burlington School District",
      "job_title": "High School Teacher"
    },
    {
      "reviewer": "Sandi Edde",
      "time_posted": "0 year ago",
      "review_text": "Brendan was an absolute pleasure to work with. He was very professional; and he was friendly and easy to talk to. Brendan was thoughtful in approaching our investment strategy and customized our situation. He...",
      "state": "Maine",
      "school_district": "Portland Public Schools",
      "job_title": "Elementary School Principal"
    },
    {
      "reviewer": "Vitaliy Petrenko",
      "time_posted": "6 months ago",
      "review_text": "I worked with Rise North Capital team to help a family member, and could not wish for a better service and advice. With their guidance I was able to navigate a complicated situation with critical illness, and thankfully we had the right coverage in place. Now my loved one has peace of mind and their finances are in order. Thank you, Matt and team, I am lucky to have you in my corner.",
      "state": "New York",
      "school_district": "New York City Department of Education",
      "job_title": "District Data Analyst"
    },
    {
      "reviewer": "Natalie Villalobos",
      "time_posted": "6 months ago",
      "review_text": "Being mentored by Kira Cummings has been an incredibly positive experience. She is highly organized, knowledgeable, and easy to follow. I never realized how much a financial representative could ease my anxiety about debt until I started working with Kira. She provided me with strategies to pay off my debt and helped me save money by guiding me toward a high-yield savings account. Kira’s organization is impressive—after every meeting, she provided a clear summary of our discussion via email, along with my action items. I highly recommend her as your financial representative!",
      "state": "California",
      "school_district": "Los Angeles Unified School District",
      "job_title": "District Communications Coordinator"
    },
    {
      "reviewer": "Ashton Perez",
      "time_posted": "6 months ago",
      "review_text": "Dominic Glasson was unbelievably helpful.",
      "state": "Texas",
      "school_district": "Austin Independent School District",
      "job_title": "Paraprofessional"
    },
    {
      "reviewer": "Mike Demers",
      "time_posted": "6 months ago",
      "review_text": "These people make you feel like you're more of a friend than a client. They make it easy to trust them.",
      "state": "Massachusetts",
      "school_district": "Lowell Public Schools",
      "job_title": "District Electrician"
    },
    {
      "reviewer": "Marie C Tasch",
      "time_posted": "6 months ago",
      "review_text": "RJ super knowable and professional. Thank you for your financial advise and support!",
      "state": "Massachusetts",
      "school_district": "Worcester Public Schools",
      "job_title": "District Accountant"
    },
    {
      "reviewer": "Nicki Darisse",
      "time_posted": "5 months ago",
      "review_text": "I have had the pleasure of working with Jacob Ciechon for a couple of years now. He has not only taken my fear of investing away he has given me someone I can trust to help me make these decisions. I would highly recommend him to help you with your financial independence.",
      "state": "Florida",
      "school_district": "Orange County Public Schools",
      "job_title": "School Counselor"
    },
    {
      "reviewer": "Monica Morales",
      "time_posted": "5 months ago",
      "review_text": "Brendan is great to work with. You can really tell he cares about putting his clients in the best position possible!",
      "state": "California",
      "school_district": "San Diego Unified School District",
      "job_title": "School Nurse"
    },
    {
      "reviewer": "Andrea White",
      "time_posted": "5 months ago",
      "review_text": "MJ has been a gem—There’s lots I’d like to learn so I’m prepared for unforeseen as well as urgency’s.",
      "state": "Ohio",
      "school_district": "Columbus City Schools",
      "job_title": "School Social Worker"
    },
    {
      "reviewer": "Ingrid Ruiz",
      "time_posted": "7 months ago",
      "review_text": "My meeting with Yen Silvia and Gabriel Purdy was very pleasant, informative and helpful towards life insurance, goals and 400k. I would 100% recommend! :)",
      "state": "Arizona",
      "school_district": "Mesa Public Schools",
      "job_title": "Elementary School Teacher"
    },
    {
      "reviewer": "Aaron Abreu",
      "time_posted": "8 months ago",
      "review_text": "Very happy to have completed my life insurance policy with Rise Capital with the help of Robert J. Marchewka! It was really stressing me out but one of those things I had to get done. Rob was VERY patient with me and communicated great whether it was by phone, zoom, text or email he took care of me and found me the discounts I needed! Thank you so so so much Rob!",
      "state": "Pennsylvania",
      "school_district": "School District of Philadelphia",
      "job_title": "Facilities Project Manager"
    },
    {
      "reviewer": "Rebecca Lauzier",
      "time_posted": "8 months ago",
      "review_text": "",
      "state": "Illinois",
      "school_district": "Chicago Public Schools",
      "job_title": "School Administrative Assistant"
    },
    {
      "reviewer": "Kaitlyn Stacks",
      "time_posted": "9 months ago",
      "review_text": "",
      "state": "New York",
      "school_district": "Yonkers Public Schools",
      "job_title": "Art Teacher"
    },
    {
      "reviewer": "Carol Forward",
      "time_posted": "5 months ago",
      "review_text": "RJ is responsive and cares about the needs of his clients. He makes himself available and always follows up with detailed notes and explains any questions that I have. HIGHLY RECOMMENDED!",
      "state": "Connecticut",
      "school_district": "West Hartford Public Schools",
      "job_title": "District Budget Analyst"
    },
    {
      "reviewer": "Stacy Kelliher",
      "time_posted": "5 months ago",
      "review_text": "R.J. has been AMAZING and nothing but helpful and very informative about our financial future.",
      "state": "Georgia",
      "school_district": "Cobb County School District",
      "job_title": "Athletic Trainer"
    },
    {
      "reviewer": "Leslie Jackson",
      "time_posted": "5 months ago",
      "review_text": "So thankful for Christian getting me on the path to retirement and keeping me there.",
      "state": "North Carolina",
      "school_district": "Wake County Public School System",
      "job_title": "School Security Officer"
    },
    {
      "reviewer": "Kaitlyn Stacks",
      "time_posted": "9 months ago",
      "review_text": "Working with Samuel and Marlen has been such an easy and beneficial experience. The organization and thoughtfulness from the both of them made this process smooth and simple. Their professionalism and altruistic personalities really allowed my husband and I to make the proper decisions for our family's life insurance policies. 9/10 recommend going through Sam and Marlen for any of your financial needs.\n\nNot only financial, but Sam took time out of his day to help me set up my Microsoft One note app and organize it like his. Sam and Marlen's eagerness and willingness to go above and beyond was something that set the bar pretty high for my family.",
      "state": "New York",
      "school_district": "Yonkers Public Schools",
      "job_title": "Art Teacher"
    },
    {
      "reviewer": "Benjamin O'Connor",
      "time_posted": "a year ago",
      "review_text": "Very efficient and catered to the goals of the client!",
      "state": "Michigan",
      "school_district": "Ann Arbor Public Schools",
      "job_title": "High School Physics Teacher"
    },
    {
      "reviewer": "Alain Bala",
      "time_posted": "a year ago",
      "review_text": "I have been working with Rise North Capital for over 2 years, and from the initial consultation to the execution of a comprehensive financial plan, their team has demonstrated exceptional expertise and dedication. They provided clear and consistent communication throughout the process and ensured that all aspects of my financial plan were handled with the utmost professionalism.",
      "state": "Texas",
      "school_district": "Houston Independent School District",
      "job_title": "Transportation Operations Manager"
    },
    {
      "reviewer": "Mary Jo Renear",
      "time_posted": "a year ago",
      "review_text": "I have been very pleased with my experience with Rise North Capital. RJ is always available to answer any questions and address any concerns I may have.",
      "state": "New Hampshire",
      "school_district": "Manchester School District",
      "job_title": "Elementary School Teacher"
    },
    {
      "reviewer": "HaverhillJake",
      "time_posted": "4 months ago",
      "review_text": "We worked with Cal Dreyer who we really like. He is knowledgeable, informative, and anticipated some of our needs. It feels good to have a plan we can trust going forward. Thanks, Cal! Matt and Deb",
      "state": "Massachusetts",
      "school_district": "Haverhill Public Schools",
      "job_title": "School IT Support Specialist"
    },
    {
      "reviewer": "Penny Mayo",
      "time_posted": "5 months ago",
      "review_text": "Excellent personal attention and attention to detail.",
      "state": "California",
      "school_district": "San Francisco Unified School District",
      "job_title": "School District General Counsel"
    }
  ]
}
